<a href="https://colab.research.google.com/github/Nav-ee-n/pandas-practice/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# Dataframe is structured data - rows and columns
# series is columns in dataframe - building blocks of dataframe - labelled 1d array - series have titles
#
# series uses more memory than array

In [ ]:
# create an array with 10 elements
a=np.arange(1,11)
a

b=pd.Series(a)
b

b.ndim
b.size
b.shape

10

In [ ]:
b.head()          #print first 5 elements
b.head(6)         #by default its 5 but value can be given

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
b.tail()          #print last 5 elements of the series
b.tail(6)         #print last elements upto given value

4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
# add two series

a=pd.Series([1,2,3,4,5])
b=pd.Series([10,20,30,40,50])
c=pd.concat([a,b],ignore_index=True)
c

0     1
1     2
2     3
3     4
4     5
5    10
6    20
7    30
8    40
9    50
dtype: int64

In [ ]:
a.add(b)
a.sub(b)
a.mul(b)
a.div(b)

0    0.1
1    0.1
2    0.1
3    0.1
4    0.1
dtype: float64

In [ ]:
# create a series with named index
a=pd.Series([1,2,3,4],index=["a","b","c","d"])
a

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
# series can be created using a dictionary
d={101:"apple",102:"orange",103:"mango"}

e=pd.Series(d)
e

101     apple
102    orange
103     mango
dtype: object

In [ ]:
s=pd.Series(4,index=[1,2,3,4,5,6])
s

1    4
2    4
3    4
4    4
5    4
6    4
dtype: int64

In [ ]:
# accessing a single element in series
s=pd.Series([1,2,3,4,5])
s[2]

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
s[2:4]

2    3
3    4
dtype: int64

In [ ]:
s[[2,4]]

2    3
4    5
dtype: int64